operate/controllers/login/LoginController.php

    public function actionLoginT()
    {
        if (\Yii::$app->request->isPost) {
            $data = \Yii::$app->request->post();
            Msg::set('手机号不能为空');
            if ($data['tel']) {
                Msg::set('验证码有误');
                if (Sms::validateCode($data['tel'], $data['code'])) {
                    if ($model = User::findOne(['tel' => $data['tel']])) {
---
SELECT * FROM `user` WHERE `tel`='18982393851'